/* eslint-disable jsx-a11y/anchor-is-valid */
import React from 'react'
import "../styles/Body.css";
import img1 from "../resources/Img1.png";
import img2 from "../resources/Img2.png";
import img3 from "../resources/Img3.png";

const BodySection3 = ({onOpenContact,onOpenRepair,onOpenInstall,onOpenService}) => {
  return (
  <>
    <section className='one'>
      <div className="informations">
        <h1>Чистые воды - Ваши решения по установке, ремонту и обслуживанию колодцев</h1>
        <p>
          Професcиональный ремонт и обслуживание колодцев, установка сопутствующих систем. Обеспечиваем качество и долговечность.
        </p>
        <div className='block_button'>
          <div className="Call_button">
          <h1 onClick={onOpenContact}>Позвонить</h1>
          </div>

          <div className="more">
          <a href='#section2'><p>Узнать больше</p></a>
          </div>
        </div>
      </div>

      <div className="image">
        <img src = {img1} alt="" />
      </div>  
    </section>
    <section id='section2' className='two'>
      <div className="image">
        <img src = {img2} alt="" />
      </div> 

      <div className="informations">
        <div className="block_info instal" onClick={onOpenInstall}>
          <svg width="100.000000" height="100.000000" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
	          <path id="矢量 63" d="M39.18 14.28L39.18 0L47.29 0C48.01 0 48.7 0.25 49.2 0.69C49.71 1.14 50 1.74 50 2.38L50 11.9C50 12.53 49.71 13.14 49.2 13.58C48.7 14.03 48.01 14.28 47.29 14.28L39.18 14.28ZM33.78 47.61C33.78 48.25 33.49 48.85 32.99 49.3C32.48 49.74 31.79 50 31.08 50L20.27 50C19.55 50 18.86 49.74 18.35 49.3C17.85 48.85 17.56 48.25 17.56 47.61L17.56 14.28L0 14.28L0 9.7C0 9.28 0.12 8.87 0.35 8.51C0.59 8.15 0.93 7.85 1.34 7.64L16.21 0L33.78 0L33.78 47.61Z" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
          </svg>

          <div className="info">
            <h1>Установка(копка) колодца</h1>
            <p>Профессиональный монтаж и копка колодца, а так же установка сопутствующих
               инженерных систем. Обеспечим надежную и эффективную
              работу инфраструктуры.
            </p>
          </div>
        </div>

        <div className="block_info service" onClick={onOpenService}>
          <svg width="80.000000" height="80.000000" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
	          <path id="矢量 42" d="M37.5 5L47.5 5C48.16 5 48.79 5.26 49.26 5.73C49.73 6.2 50 6.83 50 7.5L50 47.5C50 48.16 49.73 48.79 49.26 49.26C48.79 49.73 48.16 50 47.5 50L2.5 50C1.83 50 1.2 49.73 0.73 49.26C0.26 48.79 0 48.16 0 47.5L0 7.5C0 6.83 0.26 6.2 0.73 5.73C1.2 5.26 1.83 5 2.5 5L12.5 5L12.5 0L17.5 0L17.5 5L32.5 5L32.5 0L37.5 0L37.5 5ZM5 20L5 45L45 45L45 20L5 20ZM10 25L15 25L15 30L10 30L10 25ZM10 35L15 35L15 40L10 40L10 35ZM20 25L40 25L40 30L20 30L20 25ZM20 35L32.5 35L32.5 40L20 40L20 35Z" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
          </svg>
          <div className="info">
            <h1>Обслуживание колодца</h1>
            <p>Профилактическое и текущие обслуживание колодцев. 
               Обеспечим чистоту и эффективность работы систем чисткой и дезинфекцией.
            </p>
          </div>

        </div>

        <div className="block_info repair" onClick={onOpenRepair}>
          <svg width="100.000000" height="100.000000" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg"xlink="http://www.w3.org/1999/xlink">
	          <path id="矢量 157" d="M6.59 0.57C8.36 -0.06 10.27 -0.18 12.1 0.24C13.93 0.65 15.61 1.57 16.94 2.9C18.26 4.23 19.19 5.91 19.6 7.74C20.01 9.57 19.89 11.48 19.26 13.25L50 43.98L43.98 50L13.25 19.26C11.48 19.89 9.57 20.01 7.74 19.6C5.9 19.19 4.23 18.26 2.9 16.93C1.57 15.61 0.65 13.93 0.24 12.1C-0.18 10.26 -0.06 8.35 0.57 6.59L6.91 12.92C7.3 13.33 7.77 13.65 8.29 13.88C8.81 14.1 9.37 14.22 9.93 14.22C10.5 14.23 11.05 14.12 11.58 13.91C12.1 13.69 12.57 13.38 12.97 12.98C13.37 12.58 13.69 12.1 13.9 11.58C14.12 11.06 14.22 10.5 14.22 9.93C14.21 9.37 14.1 8.81 13.87 8.29C13.65 7.78 13.33 7.31 12.92 6.91L6.58 0.57L6.59 0.57ZM35.97 5.91L44.98 0.9L48.99 4.91L43.98 13.93L38.97 14.93L32.96 20.94L28.95 16.93L34.96 10.92L35.97 5.91L35.97 5.91ZM15.93 27.95L21.94 33.97L7.91 47.99C7.14 48.76 6.1 49.2 5.01 49.22C3.92 49.25 2.87 48.85 2.06 48.12C1.25 47.39 0.76 46.37 0.68 45.29C0.6 44.2 0.94 43.13 1.63 42.28L1.9 41.98L15.93 27.95L15.93 27.95Z" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
          </svg>
          <div className="info">
            <h1>Ремонт колодца</h1>
            <p>Услуги по ремонту колодцев с использованием качественных
               материалов и современных технологий. Обеспечим надежность
              и долговечность.
            </p>
          </div>

        </div>
        <div className="block_info exp">
          <svg width="100.000000" height="100.000000" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
	          <path id="Icon" d="M37.3958 13.75C37.3958 6.14587 31.875 0 25 0C18.125 0 12.6041 6.14587 12.6041 13.75C12.6041 21.3541 18.125 27.5 25 27.5C31.875 27.5 37.3958 21.3541 37.3958 13.75ZM50 42.7084L50 45C50 47.7084 47.7083 50 45 50L5 50C2.29167 50 0 47.7084 0 45L0 42.7084C0 36.6667 7.08333 32.9167 13.75 30L14.375 29.6875C14.8958 29.4792 15.4167 29.4792 15.9375 29.7917C18.6458 31.5625 21.6667 32.5 24.8958 32.5C28.125 32.5 31.25 31.4584 33.8542 29.7917C34.375 29.4792 34.8958 29.4792 35.4167 29.6875L36.0417 30C42.9167 32.9167 50 36.5625 50 42.7084Z" clip-rule="evenodd" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
          </svg>
          <div className="info">
            <h1>Опыт и квалификация</h1>
            <p>Команда профессионалов с многолетним опытом
               работы в сфере ремонта и обслуживания колодцев.
                Мы гарантируем качество.
            </p>
          </div>

        </div>
      </div>
    </section>
    <section className='three'>
      <div className="img">
        <img src={img3} alt=''/>
      </div>
      <div className='informations'>
        <div className="team">
          <svg width="45.846161" height="45.845703" viewBox="0 0 73.8462 73.8457" fill="none" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
	          <path id="Icon" d="M55.2307 20.3076C55.2307 9.0769 47.0769 0 36.923 0C26.7692 0 18.6153 9.0769 18.6153 20.3076C18.6153 31.5386 26.7692 40.6155 36.923 40.6155C47.0769 40.6155 55.2307 31.5386 55.2307 20.3076ZM73.8462 63.0767L73.8462 66.4612C73.8462 70.4612 70.4615 73.8457 66.4615 73.8457L7.38461 73.8457C3.38461 73.8457 0 70.4612 0 66.4612L0 63.0767C0 54.1536 10.4615 48.615 20.3077 44.3074L21.2308 43.8457C22 43.5381 22.7692 43.5381 23.5385 43.9998C27.5385 46.615 32 47.9998 36.7692 47.9998C41.5385 47.9998 46.1538 46.4612 50 43.9998C50.7692 43.5381 51.5385 43.5381 52.3077 43.8457L53.2308 44.3074C63.3846 48.615 73.8462 53.9998 73.8462 63.0767Z" clip-rule="evenodd" fill="#706E6B" fill-opacity="0.610000" fill-rule="evenodd"/>
          </svg>
          <h1>Команда Чистые Воды</h1>
          <hr />
          <p>
            Мы предоставляем профессиональные услуги 
            по установке и ремонту колодцев, заботясь
            о каждом клиенте.
          </p>
        </div>
        <div className="info">
          <h2>
            Мы предлагаем широкий спектр услуг: установку и 
            ремонт колодца и септика; Чистка, дезинфекция и ремонт колодца. Наша цель - обеспечить вашу
            безопасность и комфорт, предоставляя качественные и надежные 
            решения. Каждый проект является уникальным, и мы готовы
            предложить индивидуальный подход к каждому клиенту.
          </h2>
          <div className='call_button'>
            <a onClick={onOpenContact}>Позвонить</a>
            <svg width="21.875000" height="21.875000" viewBox="0 0 21.875 21.875" fill="none" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink">
	            <path id="矢量 13" d="M7.29 0L7.29 2.91L16.9 2.91L0 19.81L2.05 21.87L18.95 4.97L18.95 14.58L21.87 14.58L21.87 0L7.29 0Z" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
            </svg>
          </div>
        </div>
      </div>
    </section>
  </>
  )
}

export default BodySection3