import React from 'react'
import "../../styles/Module.css";

const Repair = ({ isOpenRepair, onCloseRepair}) => {
   if (!isOpenRepair) return null;

  return (
    <div className='module inf install' onClick={e => e.target.className === 'backgr' && onCloseRepair()}>
    <div className="backgr">
    </div> 
    <div className='moduleInf'>
    <div className="exit"><p onClick={onCloseRepair}>X</p></div>
    <svg width="100.000000" height="100.000000" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg"xlink="http://www.w3.org/1999/xlink">
      <path id="矢量 157" d="M6.59 0.57C8.36 -0.06 10.27 -0.18 12.1 0.24C13.93 0.65 15.61 1.57 16.94 2.9C18.26 4.23 19.19 5.91 19.6 7.74C20.01 9.57 19.89 11.48 19.26 13.25L50 43.98L43.98 50L13.25 19.26C11.48 19.89 9.57 20.01 7.74 19.6C5.9 19.19 4.23 18.26 2.9 16.93C1.57 15.61 0.65 13.93 0.24 12.1C-0.18 10.26 -0.06 8.35 0.57 6.59L6.91 12.92C7.3 13.33 7.77 13.65 8.29 13.88C8.81 14.1 9.37 14.22 9.93 14.22C10.5 14.23 11.05 14.12 11.58 13.91C12.1 13.69 12.57 13.38 12.97 12.98C13.37 12.58 13.69 12.1 13.9 11.58C14.12 11.06 14.22 10.5 14.22 9.93C14.21 9.37 14.1 8.81 13.87 8.29C13.65 7.78 13.33 7.31 12.92 6.91L6.58 0.57L6.59 0.57ZM35.97 5.91L44.98 0.9L48.99 4.91L43.98 13.93L38.97 14.93L32.96 20.94L28.95 16.93L34.96 10.92L35.97 5.91L35.97 5.91ZM15.93 27.95L21.94 33.97L7.91 47.99C7.14 48.76 6.1 49.2 5.01 49.22C3.92 49.25 2.87 48.85 2.06 48.12C1.25 47.39 0.76 46.37 0.68 45.29C0.6 44.2 0.94 43.13 1.63 42.28L1.9 41.98L15.93 27.95L15.93 27.95Z" fill="#008FFF" fill-opacity="1.000000" fill-rule="evenodd"/>
    </svg>
    <h1>Ремонт колодцев</h1>
    <p>Восстановление поврежденных колодцев, 
      замена колец, герметизация, очистка от 
      загрязнений и устранение протечек.
    </p>
    <ul class="list">
      <li>Замена поврежденных колец</li>
      <li>Герметизация швов</li>
      <li>Ремонт дна</li>
      <li>Восстановление гидроизоляции</li>
    </ul>
    <div className="price">
      <h2>Цена ~ от 65 бел.руб.</h2>
    </div>
    </div>
    </div>
  )
}

export default Repair